arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lin/fsl_lin_lpuart_driver.c
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modif ication,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specif ic prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES,
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*******************************************************************************
 * Includes
 ******************************************************************************/
#include "fsl_lin_lpuart_driver.h"

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*! @brief Table of base addresses for LPUART instances. */
LPUART_Type * const g_linLpuartBase[LPUART_INSTANCE_COUNT] = LPUART_BASE_PTRS;

/*! @brief Table to save LPUART IRQ enumeration numbers defined in the CMSIS header file */
const IRQn_Type g_linLpuartRxTxIrqId[LPUART_INSTANCE_COUNT] = LPUART_RX_TX_IRQS;

/*! @brief Table to save LPUART state structure pointers */
lin_state_t * g_linStatePtr[LPUART_INSTANCE_COUNT] = {0};

/*! @brief Table to save LIN user config structure pointers */
lin_user_config_t * g_linUserconfigPtr[LPUART_INSTANCE_COUNT] = {0};

/*! @brief Table to save ISR pointers for LPUART instances */
extern isr_t g_linLpuartIsrs[LPUART_INSTANCE_COUNT];

/*******************************************************************************
 * Static function prototypes
 ******************************************************************************/

static lin_status_t LIN_LPUART_DRV_WaitComplete(uint32_t instance);

static void LIN_LPUART_DRV_AutobaudTimerValEval(uint32_t instance,
                                                lin_user_config_t * linUserConfig);

static void LIN_LPUART_DRV_PROCESS_DATA(uint32_t instance,
                                        lin_user_config_t * linUserConfig,
                                        lin_state_t * linCurrentState,
                                        uint8_t tmpByte);

/*******************************************************************************
 * Code
 ******************************************************************************/
/*FUNCTION**********************************************************************
 *
 * Function Name : LIN_LPUART_DRV_Init
 * Description   : This function initializes a LPUART instance for operation.
 * This function will initialize the run-time state structure to keep track of
 * the on-going transfers, ungate the clock to the LPUART module, initialize the
 * module to user defined settings and default settings, configure the IRQ state
 * structure and enable the module-level interrupt to the core, and enable the
 * LPUART module transmitter and receiver.
 *
 *END**************************************************************************/
lin_status_t LIN_LPUART_DRV_Init(uint32_t instance,
                                 lin_user_config_t * linUserConfig,
                                 lin_state_t * linCurrentState)
{
    /* Assert parameters. */
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(linUserConfig && linCurrentState);
    DEV_ASSERT(instance < LPUART_INSTANCE_COUNT);
#endif

    /*! @brief Table to save LPUART clock names as defined in clock manager. */
    clock_names_t g_linLpuartClkNames[LPUART_INSTANCE_COUNT] = {PCC_LPUART0_CLOCK, PCC_LPUART1_CLOCK, PCC_LPUART2_CLOCK, PCC_LPUART3_CLOCK};

    lin_status_t retVal = LIN_SUCCESS;

    /* Get base address of the LPUART instance. */
    LPUART_Type * base = g_linLpuartBase[instance];

    /* Check if the instance is already initialized. */
    if (g_linStatePtr[instance])
    {
        retVal = LIN_INITIALIZED;
    }

    else
    {
         /* Save runtime structure pointer. */
        g_linStatePtr[instance] = linCurrentState;

        /* Save LIN user config structure pointer. */
        g_linUserconfigPtr[instance] = linUserConfig;

        /* Get the LPUART clock as configured in the clock manager */
        (void)CLOCK_SYS_GetFreq(g_linLpuartClkNames[instance], &linCurrentState->linSourceClockFreq);

        /* Exit if current instance is clock gated. */
        if (linCurrentState->linSourceClockFreq == 0U)
        {
            retVal = LIN_LPUART_STAT_CLOCK_GATED_OFF;
        }
        else
        {
            /* Init LPUART */
            LPUART_HAL_Init(base);

            /* if autobaud is enabled */
            if ((linUserConfig->autobaudEnable) && (linUserConfig->nodeFunction == (bool)SLAVE))
            {
                /* Setting Slave's baudrate to 20000 will help Slave node */
                /* always detect LIN Break from Master */
                linUserConfig->baudRate = 20000U;
                linCurrentState->fallingEdgeInterruptCount = 0U;
                linCurrentState->baudrateEvalEnable = true;
            }
            /* Set baudrate to User's value */
            (void)LPUART_HAL_SetBaudRate(base, linCurrentState->linSourceClockFreq, linUserConfig->baudRate);

            /* Set 8 bit counts per char */
            LPUART_HAL_SetBitCountPerChar(base, LPUART_8_BITS_PER_CHAR);

            /* Set no parity mode */
            LPUART_HAL_SetParityMode(base, LPUART_PARITY_DISABLED);

            /* One stop bit */
            LPUART_HAL_SetStopBitCount(base, LPUART_ONE_STOP_BIT);

            /* Set Break char length as 13 bits minimum */
            LPUART_HAL_SetBreakCharTransmitLength(base, LPUART_BREAK_CHAR_13_BIT_MINIMUM);

            /* Enable the LPUART transmitter and receiver */
            LPUART_HAL_SetTransmitterCmd(base, true);
            LPUART_HAL_SetReceiverCmd(base, true);

