arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lin/fsl_lin_lpuart_driver.c
            /* Set Break char detect length as 13 bits minimum */
            LPUART_HAL_SetBreakCharDetectLength(base, LPUART_BREAK_CHAR_13_BIT_MINIMUM);

            /* Enable RX complete interrupt */
            LPUART_HAL_SetIntMode(base, LPUART_INT_RX_DATA_REG_FULL, true);

            /* Enable frame error interrupt */
            LPUART_HAL_SetIntMode(base, LPUART_INT_FRAME_ERR_FLAG, true);

            /* Enable LIN break detect interrupt */
            LPUART_HAL_SetIntMode(base, LPUART_INT_LIN_BREAK_DETECT, true);

            /* Instal LIN ISR for LPUART instance */
            (void)INT_SYS_InstallHandler(g_linLpuartRxTxIrqId[instance], g_linLpuartIsrs[instance], (isr_t*) 0);

            /* Enable LPUART interrupt. */
            INT_SYS_EnableIRQ(g_linLpuartRxTxIrqId[instance]);

            /* Change node's current state to IDLE */
            linCurrentState->currentNodeState = LIN_NODE_STATE_IDLE;

            /* Clear flags in current LIN state structure */
            linCurrentState->isTxBusy = false;
            linCurrentState->isRxBusy = false;
            linCurrentState->isBusBusy = false;
            linCurrentState->isRxBlocking = false;
            linCurrentState->isTxBlocking = false;
            linCurrentState->timeoutCounterFlag = false;
        } /* End of if (!linCurrentState->linSourceClockFreq) */
    } /* End of if (g_linStatePtr[instance]) */

    return retVal;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LIN_LPUART_DRV_Deinit
 * Description   : This function shuts down the LPUART by disabling interrupts and
 *                 transmitter/receiver.
 *
 *END**************************************************************************/
lin_status_t LIN_LPUART_DRV_Deinit(uint32_t instance)
{
    /* Assert parameters. */
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPUART_INSTANCE_COUNT);
#endif

    lin_status_t retVal = LIN_SUCCESS;

    /* Get base address of the LPUART instance. */
    LPUART_Type * base = g_linLpuartBase[instance];

    /* Get the current LIN state of this LPUART instance. */
    lin_state_t *linCurrentState = g_linStatePtr[instance];

    /* Check if the LIN state pointer is 0. */
    if ((!linCurrentState) || (!linCurrentState->linSourceClockFreq))
    {
        retVal = LIN_ERROR;
    }
    else
    {
        /* Wait until the data is completely shifted out of shift register */
        while (!LPUART_HAL_GetStatusFlag(base, LPUART_TX_COMPLETE))
        {}

        /* Disable the LPUART transmitter and receiver */
        LPUART_HAL_SetTransmitterCmd(base, false);
        LPUART_HAL_SetReceiverCmd(base, false);

        /* Disable LPUART interrupt. */
        INT_SYS_DisableIRQ(g_linLpuartRxTxIrqId[instance]);

        /* Change node's current state to UNINIT */
        linCurrentState->currentNodeState = LIN_NODE_STATE_UNINIT;

        /* Clear our saved pointer to the LIN state structure */
        g_linStatePtr[instance] = 0U;
    }

    return retVal;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LIN_LPUART_DRV_InstallCallback
 * Description   : This function installs the callback function that is used for LIN_LPUART_DRV_IRQHandler.
 * Pass in Null pointer as callback will uninstall.
 *
 *END**************************************************************************/
lin_callback_t LIN_LPUART_DRV_InstallCallback(uint32_t instance,
                                              lin_callback_t function)
{
    /* Assert parameters. */
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPUART_INSTANCE_COUNT);
#endif

    /* Get the current LIN state of this LPUART instance. */
    lin_state_t *linCurrentState = g_linStatePtr[instance];

    /* Get the current callback function. */
    lin_callback_t currentCallback = linCurrentState->Callback;

    /* Install new callback function. */
    linCurrentState->Callback = function;

    return currentCallback;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LIN_LPUART_DRV_SendFrameDataBlocking
 * Description   : This function sends data out through the LPUART module using
 * blocking method. This function will calculate the checksum byte and send it
 * with the frame data.  The function does not return until the transmission
 * is complete.
 *
 *END**************************************************************************/
lin_status_t LIN_LPUART_DRV_SendFrameDataBlocking(uint32_t instance,
                                                  const uint8_t * txBuff,
                                                  uint8_t txSize,
                                                  uint32_t timeout)
{
    /* Assert parameters. */
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(txBuff);
    DEV_ASSERT(instance < LPUART_INSTANCE_COUNT);
#endif

    /* Get base address of the LPUART instance. */
    LPUART_Type * base = g_linLpuartBase[instance];

    /* Get the current LIN state of this LPUART instance. */
    lin_state_t *linCurrentState = g_linStatePtr[instance];
    lin_status_t retVal = LIN_SUCCESS;

    /* Check if the LIN Bus is busy */
    if (linCurrentState->isBusBusy)
    {
        retVal = LIN_BUS_BUSY;
    }
    else
    {
        /* Make the checksum byte. */
        linCurrentState->checkSum = LIN_DRV_MakeChecksumByte(txBuff, txSize, linCurrentState->currentPid);

        /* Update the LIN state structure. */
        linCurrentState->txBuff = txBuff;
        /* Add a place for checksum byte */
        linCurrentState->txSize = txSize + 1U;
        linCurrentState->cntByte = 0U;
        linCurrentState->currentEventId = LIN_NO_EVENT;
        linCurrentState->isBusBusy = true;
        linCurrentState->isTxBusy = true;
        linCurrentState->isTxBlocking = true;

        /* Set Break char detect length as 10 bits minimum */
        LPUART_HAL_SetBreakCharDetectLength(base, LPUART_BREAK_CHAR_10_BIT_MINIMUM);
        linCurrentState->timeoutCounterFlag = false;
        linCurrentState->timeoutCounter = timeout;

