arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lin/fsl_lin_lpuart_driver.c
        /* Set node's current state to SEND_DATA */
        linCurrentState->currentNodeState = LIN_NODE_STATE_SEND_DATA;

        /* Start sending data */
        LPUART_HAL_Putchar(base, *linCurrentState->txBuff);

        /* Wait until the transmission is complete. */
        retVal = LIN_LPUART_DRV_WaitComplete(instance);

        /* Update Bus Busy flag. */
        linCurrentState->isBusBusy = false;
        linCurrentState->isTxBusy = false;

        /* Update node's current state to IDLE. */
        linCurrentState->currentNodeState = LIN_NODE_STATE_IDLE;
    }

    return retVal;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LIN_LPUART_DRV_SendFrameData
 * Description   : This function sends data out through the LPUART module using
 * non-blocking method. This function will calculate the checksum byte and send
 * it with the frame data. The function will return immediately after calling
 * this function.
 *
 *END**************************************************************************/
lin_status_t LIN_LPUART_DRV_SendFrameData(uint32_t instance,
                                          const uint8_t * txBuff,
                                          uint8_t txSize)
{
    /* Assert parameters. */
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(txBuff);
    DEV_ASSERT(instance < LPUART_INSTANCE_COUNT);
#endif

    lin_status_t retVal = LIN_SUCCESS;

    /* Get base address of the LPUART instance. */
    LPUART_Type * base = g_linLpuartBase[instance];

    /* Get the current LIN state of this LPUART instance. */
    lin_state_t *linCurrentState = g_linStatePtr[instance];

    /* Check if the LIN Bus is busy */
    if (linCurrentState->isBusBusy)
    {
        retVal = LIN_BUS_BUSY;
    }
    else
    {
        /* Make the checksum byte. */
        linCurrentState->checkSum = LIN_DRV_MakeChecksumByte(txBuff, txSize, linCurrentState->currentPid);

        /* Update the LIN state structure. */
        linCurrentState->txBuff = txBuff;
        /* Add a place for checksum byte */
        linCurrentState->txSize = txSize + 1U;
        linCurrentState->cntByte = 0U;
        linCurrentState->currentNodeState = LIN_NODE_STATE_SEND_DATA;
        linCurrentState->currentEventId = LIN_NO_EVENT;
        linCurrentState->isBusBusy = true;
        linCurrentState->isTxBusy = true;
        linCurrentState->isTxBlocking = false;

        /* Set Break char detect length as 10 bits minimum */
        LPUART_HAL_SetBreakCharDetectLength(base, LPUART_BREAK_CHAR_10_BIT_MINIMUM);

        /* Start sending data */
        LPUART_HAL_Putchar(base, *linCurrentState->txBuff);
    }

    return retVal;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LIN_LPUART_DRV_GetTransmitStatus
 * Description   : This function returns whether the previous LPUART transmit has
 * finished. When performing non-blocking transmit, the user can call this
 * function to ascertain the state of the current transmission:
 * in progress (or busy that is LIN_TX_BUSY) or timeout (if timeout has occurred that is
 * LIN_TIMEOUT) or complete (success that is LIN_SUCCESS).
 * In addition, if the transmission is still in progress, the user can obtain the number
 * of bytes that still needed to transmit.
 *
 *END**************************************************************************/
lin_status_t LIN_LPUART_DRV_GetTransmitStatus(uint32_t instance,
                                              uint8_t * bytesRemaining)
{
    /* Assert parameters. */
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPUART_INSTANCE_COUNT);
#endif

    lin_status_t retVal = LIN_SUCCESS;

    /* Get the current LIN state of this LPUART instance. */
    lin_state_t *linCurrentState = g_linStatePtr[instance];

    /* Get the number of bytes that is still needed to transmit */
    *bytesRemaining = linCurrentState->txSize - linCurrentState->cntByte;

    /* Return status of the on-going transmission */
    if ((linCurrentState->currentEventId == LIN_NO_EVENT) && (*bytesRemaining != 0U))
    {
        if (linCurrentState->timeoutCounterFlag == false)
        {
            retVal = LIN_TX_BUSY;
        }
        else
        {
            retVal = LIN_TIMEOUT;
        }
    }

    return retVal;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_DRV_ReceiveDataBlocking
 * Description   : This function receives data from LPUART module using blocking
 * method, the function does not return until the receive is complete. This
 * function will check the checksum byte. If the checksum is correct, it will
 * receive the frame data.
 *
 *END**************************************************************************/
lin_status_t LIN_LPUART_DRV_ReceiveFrameDataBlocking(uint32_t instance,
                                                     uint8_t * rxBuff,
                                                     uint8_t rxSize,
                                                     uint32_t timeout)
{
    /* Assert parameters. */
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(rxBuff);
    DEV_ASSERT(instance < LPUART_INSTANCE_COUNT);
#endif

    /* Get base address of the LPUART instance. */
    LPUART_Type * base = g_linLpuartBase[instance];

    /* Get the current LIN state of this LPUART instance. */
    lin_state_t *linCurrentState = g_linStatePtr[instance];
    lin_status_t retVal = LIN_SUCCESS;

    /* Check if the LIN Bus is busy */
    if (linCurrentState->isBusBusy)
    {
        retVal = LIN_BUS_BUSY;
    }
    else
    {
        /* Update the LIN state structure. */
        linCurrentState->rxBuff = rxBuff;
        /* Add a place for checksum byte */
        linCurrentState->rxSize = rxSize + 1U;
        linCurrentState->cntByte = 0U;
        linCurrentState->timeoutCounterFlag = false;
        linCurrentState->timeoutCounter = timeout;

        /* Start receiving data */
        linCurrentState->currentNodeState = LIN_NODE_STATE_RECV_DATA;
        linCurrentState->currentEventId = LIN_NO_EVENT;
        linCurrentState->isBusBusy = true;
        linCurrentState->isRxBlocking = true;

