arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lin/fsl_lin_lpuart_driver.c
            /* Send Break field */
            linCurrentState->currentNodeState = LIN_NODE_STATE_SEND_BREAK_FIELD;
            linCurrentState->currentEventId = LIN_NO_EVENT;
            linCurrentState->isBusBusy = true;

            /* Set Break char detect length as 10 bits minimum */
            LPUART_HAL_SetBreakCharDetectLength(base, LPUART_BREAK_CHAR_13_BIT_MINIMUM);
            LPUART_HAL_SetIntMode(base, LPUART_INT_LIN_BREAK_DETECT, true);

            /* Write 1 and then 0 to SBK queues a break character in the transmit data stream */
            LPUART_HAL_QueueBreakCharToSend(base, true);
            LPUART_HAL_QueueBreakCharToSend(base, false);
        }
    }

    return retVal;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LIN_LPUART_DRV_EnableIRQ
 * Description   : This function enables LPUART hardware interrupts.
 *
 *END**************************************************************************/
lin_status_t LIN_LPUART_DRV_EnableIRQ(uint32_t instance)
{
    /* Assert parameters. */
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPUART_INSTANCE_COUNT);
#endif
    lin_status_t retVal = LIN_SUCCESS;

    /* Get base address of the LPUART instance. */
    LPUART_Type * base = g_linLpuartBase[instance];

    /* Get the current LIN state of this LPUART instance. */
    lin_state_t *linCurrentState = g_linStatePtr[instance];

    if (linCurrentState->currentNodeState == LIN_NODE_STATE_SLEEP_MODE)
    {
        /* Enable RX Input Active Edge interrupt */
        LPUART_HAL_SetIntMode(base, LPUART_INT_RX_ACTIVE_EDGE, true);
    }
    else
    {
        /* Enable RX complete interrupt */
        LPUART_HAL_SetIntMode(base, LPUART_INT_RX_DATA_REG_FULL, true);

        /* Enable frame error interrupt */
        LPUART_HAL_SetIntMode(base, LPUART_INT_FRAME_ERR_FLAG, true);

        /* Enable LIN break detect interrupt */
        LPUART_HAL_SetIntMode(base, LPUART_INT_LIN_BREAK_DETECT, true);

    }
    /* Enable LPUART interrupt. */
    INT_SYS_EnableIRQ(g_linLpuartRxTxIrqId[instance]);
    return retVal;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LIN_LPUART_DRV_DisableIRQ
 * Description   : This function disables LPUART hardware interrupts.
 *
 *END**************************************************************************/
lin_status_t LIN_LPUART_DRV_DisableIRQ(uint32_t instance)
{
    /* Assert parameters. */
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPUART_INSTANCE_COUNT);
#endif
    lin_status_t retVal = LIN_SUCCESS;

    /* Get base address of the LPUART instance. */
    LPUART_Type * base = g_linLpuartBase[instance];

    /* Get the current LIN state of this LPUART instance. */
    lin_state_t *linCurrentState = g_linStatePtr[instance];

    if (linCurrentState->currentNodeState == LIN_NODE_STATE_SLEEP_MODE)
    {
        /* Disable RX Input Active Edge interrupt */
        LPUART_HAL_SetIntMode(base, LPUART_INT_RX_ACTIVE_EDGE, false);
    }
    else
    {
        /* Disable RX complete interrupt */
        LPUART_HAL_SetIntMode(base, LPUART_INT_RX_DATA_REG_FULL, false);

        /* Disable frame error interrupt */
        LPUART_HAL_SetIntMode(base, LPUART_INT_FRAME_ERR_FLAG, false);

        /* Disable frame error interrupt */
        LPUART_HAL_SetIntMode(base, LPUART_INT_LIN_BREAK_DETECT, false);
    }

    /* Disable LPUART interrupt. */
    INT_SYS_DisableIRQ(g_linLpuartRxTxIrqId[instance]);
    return retVal;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LIN_LPUART_DRV_IRQHandler
 * Description   : Interrupt handler for LPUART.
 * This handler uses the buffers stored in the lin_state_t structs to transfer
 * data. This is not a public API as it is called by IRQ whenever an interrupt
 * occurs.
 *
 *END**************************************************************************/
void LIN_LPUART_DRV_IRQHandler(uint32_t instance)
{
    /* Assert parameters. */
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPUART_INSTANCE_COUNT);
#endif

    uint8_t tmpByte;
    uint32_t wakeupSignalLength = 0;

    /* Get the current LIN user config structure of this LPUART instance. */
    lin_user_config_t *linUserConfig = g_linUserconfigPtr[instance];

    /* Get base address of the LPUART instance. */
    LPUART_Type * base = g_linLpuartBase[instance];

    /* Get the current LIN state of this LPUART instance. */
    lin_state_t *linCurrentState = g_linStatePtr[instance];

    /* If LIN break character has been detected. */
    if (LPUART_HAL_GetStatusFlag(base, LPUART_LIN_BREAK_DETECT))
    {
        /* Clear LIN Break Detect Interrupt Flag */
        (void)LPUART_HAL_ClearStatusFlag(base, LPUART_LIN_BREAK_DETECT);

        /* Check if the current node is in SLEEP MODE */
        if (linCurrentState->currentNodeState == LIN_NODE_STATE_SLEEP_MODE)
        {
            /* Change the node's current state to IDLE */
            (void)LIN_LPUART_DRV_GotoIdleState(instance);
        }
        else
        {
            /* Set Break char detect length as 10 bits minimum */
            LPUART_HAL_SetBreakCharDetectLength(base, LPUART_BREAK_CHAR_10_BIT_MINIMUM);
            /* Disable LIN Break Detect Interrupt */
            LPUART_HAL_SetIntMode(base, LPUART_INT_LIN_BREAK_DETECT, false);

            /* Set flag LIN bus busy */
            linCurrentState->isBusBusy = true;

            /* Check if the current node is MASTER */
            if (linUserConfig->nodeFunction == (bool)MASTER)  /* Master */
            {
                /* Change the node's current state to SENDING PID */
                linCurrentState->currentNodeState = LIN_NODE_STATE_SEND_PID;
                /* Send Sync Field 0x55 */
                LPUART_HAL_Putchar(base, 0x55);    /* Send SYNC field */
            }
            /* If the current node is SLAVE */
            else
            {
                /* If the Autobaud feature is enabled */
                if (linUserConfig->autobaudEnable && linCurrentState->baudrateEvalEnable)
                {
                    /* Set Receive Data Not Inverted */
                    LPUART_HAL_SetRxDataPolarity(base, false);

                    /* Enable RXEDG interrupt */
                    LPUART_HAL_SetIntMode(base, LPUART_INT_RX_ACTIVE_EDGE, true);

                    /* Disable Receiver Interrupt */
                    LPUART_HAL_SetIntMode(base, LPUART_INT_RX_DATA_REG_FULL, false);

                    /* Disable frame error interrupt */
                    LPUART_HAL_SetIntMode(base, LPUART_INT_FRAME_ERR_FLAG, false);

                    /* Start Autobaud Count */
                    linCurrentState->fallingEdgeInterruptCount = 0U;
                }

                /* Change the node's current state to RECEIVED BREAK FIELD */
                linCurrentState->currentEventId = LIN_RECV_BREAK_FIELD_OK;

