arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lin/fsl_lin_lpuart_driver.c
                /* Callback function */
                linCurrentState->Callback(instance, linCurrentState);

                /* Change the node's current state to RECEIVING SYNC FIELD */
                linCurrentState->currentNodeState = LIN_NODE_STATE_RECV_SYNC;
            }
        }
    }
    else
    {
        /* If LPUART_RX Pin Active Edge has been detected. */
        if (LPUART_HAL_GetStatusFlag(base, LPUART_RX_ACTIVE_EDGE_DETECT))
        {
            /* Clear LPUART_RX Pin Active Edge Interrupt Flag. */
            (void)LPUART_HAL_ClearStatusFlag(base, LPUART_RX_ACTIVE_EDGE_DETECT);

            /* Check if the node is in SLEEP MODE */
            /* If yes, then check if a wakeup signal has been received */
            if (linCurrentState->currentNodeState == LIN_NODE_STATE_SLEEP_MODE)
            {
                /* if LPUART_HAL_GetRxDataPolarity is 0: Receive Data is not inverted */
                if (LPUART_HAL_GetRxDataPolarity(base) == 0U)
                {
                    /* Start measure time */
                    linUserConfig->timerStartCallback();
                    /* Set Receive Data Inverted */
                    LPUART_HAL_SetRxDataPolarity(base, true);
                }
                else
                {
                    /* Set Receive Data is Not Inverted */
                    LPUART_HAL_SetRxDataPolarity(base, false);

                   /* Calculate time interval between the falling and rising edge */
                    linUserConfig->timerGetUsCallback(&wakeupSignalLength);

                    /* If length of the dominant signal is from 150us to 5ms, it is a wakeup signal */
                    if ((wakeupSignalLength >= 150U) && (wakeupSignalLength <= 5000U))
                    {
                        linCurrentState->currentEventId = LIN_WAKEUP_SIGNAL;

                        /* Callback to handle event: Received a wakeup signal */
                        linCurrentState->Callback(instance, linCurrentState);

                        /* Change node's state to IDLE */
                        (void)LIN_LPUART_DRV_GotoIdleState(instance);
                    }
                }
            }
            /* If the node is not in SLEEP MODE */
            /* Then check sync byte if Resynchronization is enabled */
            else
            {
                /* if Autobaud feature is enabled */
                if (linUserConfig->autobaudEnable && linCurrentState->baudrateEvalEnable)
                {
                    if (linCurrentState->fallingEdgeInterruptCount == 0U)
                    {
                      /* Start time measurement */
                      linUserConfig->timerStartCallback();
                    }

                    linCurrentState->fallingEdgeInterruptCount += 1U;
                    /* Process evaluation */
                    if (linCurrentState->fallingEdgeInterruptCount == 0x05U)
                    {
                        /* Clear autobaud flag */
                        linCurrentState->fallingEdgeInterruptCount = 0U;

                        /* Evaluate Timer Value to set desired baudrate */
                        LIN_LPUART_DRV_AutobaudTimerValEval(instance, linUserConfig);

                        /* Enable Receiver Interrupt */
                        LPUART_HAL_SetIntMode(base, LPUART_INT_RX_DATA_REG_FULL, true);
                        /* Disable RXEDG interrupt */
                        LPUART_HAL_SetIntMode(base, LPUART_INT_RX_ACTIVE_EDGE, false);
                        /* Enable frame error interrupt */
                        LPUART_HAL_SetIntMode(base, LPUART_INT_FRAME_ERR_FLAG, true);
                    }
                }
            }
        }
        else
        {
            /* If Framing Error has been detected */
            if (LPUART_HAL_GetStatusFlag(base, LPUART_FRAME_ERR))
            {
                /* Clear Framing Error Interrupt Flag */
                (void)LPUART_HAL_ClearStatusFlag(base, LPUART_FRAME_ERR);

                /* Set current event id to LIN_FRAME_ERROR */
                linCurrentState->currentEventId = LIN_FRAME_ERROR;
                if ((linCurrentState->isTxBlocking == false) && (linCurrentState->currentNodeState == LIN_NODE_STATE_SEND_DATA))
                {
                    /* Callback function to handle Framing Error Event */
                    linCurrentState->Callback(instance, linCurrentState);
                }
                else
                {
                    if ((linCurrentState->isRxBlocking == false) && (linCurrentState->currentNodeState == LIN_NODE_STATE_RECV_DATA))
                    {
                        /* Callback function to handle Framing Error Event */
                        linCurrentState->Callback(instance, linCurrentState);
                    }
                }
                /* Clear Bus busy Flag */
                linCurrentState->isBusBusy = false;
                /* Change node's state to IDLE */
                (void)LIN_LPUART_DRV_GotoIdleState(instance);
            }
            else
            {

                if (LPUART_HAL_GetStatusFlag(base, LPUART_RX_DATA_REG_FULL))
                {
                    /* Get data from Data Register & Clear LPUART_RX_DATA_REG_FULL flag */
                    LPUART_HAL_Getchar(base, &tmpByte);

                    /* Process data in Data Register while receive, send data */
                    LIN_LPUART_DRV_PROCESS_DATA(instance, linUserConfig, linCurrentState, tmpByte);
                }
            } /* End else: if (LPUART_HAL_GetStatusFlag(base, LPUART_FRAME_ERR) == 0) */
        } /* End else: if (LPUART_HAL_GetStatusFlag(base, LPUART_RX_ACTIVE_EDGE_DETECT) == 0) */
    } /* End else: if (LPUART_HAL_GetStatusFlag(base, LPUART_LIN_BREAK_DETECT) == 0) */

    return;
} /* End void LIN_LPUART_DRV_IRQHandler(uint32_t instance) */

/*FUNCTION**********************************************************************
 *
 * Function Name : LIN_LPUART_DRV_PROCESS_DATA
 * Description   : Part of Interrupt handler for receiving and sending data.
 * Receive Sync byte, PID, Frame data and Send PID, data.
 *END**************************************************************************/
static void LIN_LPUART_DRV_PROCESS_DATA(uint32_t instance,
                                        lin_user_config_t * linUserConfig,
                                        lin_state_t * linCurrentState,
                                        uint8_t tmpByte)
{
    /* Get base address of the LPUART instance. */
    LPUART_Type * base = g_linLpuartBase[instance];

    /* Check node's current state */
    switch (linCurrentState->currentNodeState)
    {
        /* if current state is RECEIVE SYNC FIELD */
        case LIN_NODE_STATE_RECV_SYNC:
            if (tmpByte == 0x55U)
            {
                linCurrentState->currentEventId = LIN_RECV_SYNC_OK;

                /* Change node's current state to RECEIVE PID */
                linCurrentState->currentNodeState = LIN_NODE_STATE_RECV_PID;
            }
            else
            {
                linCurrentState->currentEventId = LIN_RECV_SYNC_ERROR;

                /* Callback function to handle event RECEIVED SYNC FIELD ERROR */
                linCurrentState->Callback(instance, linCurrentState);

                /* Clear Bus busy flag */
                linCurrentState->isBusBusy = false;

