arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lin/fsl_lin_lpuart_driver.c
                /* Change node's current state to IDLE */
                (void)LIN_LPUART_DRV_GotoIdleState(instance);
            }
            break;
        /* if current state is MASTER SENDING PID */
        case LIN_NODE_STATE_SEND_PID:
            /* Change node's current state to RECEIVING PID */
            linCurrentState->currentNodeState = LIN_NODE_STATE_RECV_PID;
            /* Send the current PID byte */
            LPUART_HAL_Putchar(base, linCurrentState->currentPid);
            break;
        /* if current state is RECEIVE PID */
        case LIN_NODE_STATE_RECV_PID:
            /* if the node is MASTER */
            if (linUserConfig->nodeFunction == (bool)MASTER)
            {
                /* Set current event ID to PID correct */
                linCurrentState->currentEventId = LIN_PID_OK;

                /* Clear Bus bus flag */
                linCurrentState->isBusBusy = false;

                /* Callback function to handle correct PID */
                linCurrentState->Callback(instance, linCurrentState);
            }
            /* If the node is SLAVE */
            else
            {
                /* Check the received PID */
                linCurrentState->currentId = LIN_DRV_ProcessParity(tmpByte, CHECK_PARITY);
                linCurrentState->currentPid = tmpByte;
                if (linCurrentState->currentId != 0xFFU)
                {
                    /* Set current event ID to PID correct */
                    linCurrentState->currentEventId = LIN_PID_OK;

                   /* Clear Bus bus flag */
                    linCurrentState->isBusBusy = false;

                    /* Callback function to handle correct PID */
                    linCurrentState->Callback(instance, linCurrentState);

                }
                else
                {
                    /* Set current event ID to PID ERROR */
                    linCurrentState->currentEventId = LIN_PID_ERROR;

                    /* Callback function to handle correct PID */
                    linCurrentState->Callback(instance, linCurrentState);

                    /* Clear Bus bus flag */
                    linCurrentState->isBusBusy = false;

                    /* Change node's current state to IDLE */
                    (void)LIN_LPUART_DRV_GotoIdleState(instance);
                }
            }
            break;
        /* if current state is RECEIVE DATA */
        case LIN_NODE_STATE_RECV_DATA:
            if ((linCurrentState->rxSize - linCurrentState->cntByte) > 1U)
            {
                *(linCurrentState->rxBuff) = tmpByte;
                linCurrentState->rxBuff++;
            }
            else
            {
                if ((linCurrentState->rxSize - linCurrentState->cntByte) == 1U)
                {
                    linCurrentState->checkSum = tmpByte;
                }
            }

            linCurrentState->cntByte++;
            if (linCurrentState->cntByte == linCurrentState->rxSize)
            {
                /* Restore rxBuffer pointer */
                linCurrentState->rxBuff -= linCurrentState->rxSize - 1U;
                if (LIN_DRV_MakeChecksumByte(linCurrentState->rxBuff, linCurrentState->rxSize - 1U, linCurrentState->currentPid) == linCurrentState->checkSum)
                {
                    linCurrentState->currentEventId = LIN_RX_COMPLETED;
                    if (linCurrentState->isRxBlocking == false)
                    {
                        linCurrentState->currentNodeState = LIN_NODE_STATE_CALLBACK;
                        /* callback function to handle RX COMPLETED */
                        linCurrentState->Callback(instance, linCurrentState);
                        /* Clear Bus bus flag */
                        linCurrentState->isBusBusy = false;
                        linCurrentState->isRxBusy = false;

                        /* In case of receiving a go to sleep request, after callback, node is in SLEEP MODE */
                        /* In this case, node is in SLEEP MODE state */
                        if (linCurrentState->currentNodeState != LIN_NODE_STATE_SLEEP_MODE)
                        {
                            (void)LIN_LPUART_DRV_GotoIdleState(instance);
                        }
                    }
                }
                else
                {
                    linCurrentState->currentEventId = LIN_CHECKSUM_ERROR;
                    if (linCurrentState->isRxBlocking == false)
                    {
                        /* callback function to handle checksum error */
                        linCurrentState->Callback(instance, linCurrentState);
                        /* Clear Bus bus flag */
                        linCurrentState->isBusBusy = false;
                        linCurrentState->isRxBusy = false;
                        /* Change node's current state to IDLE */
                        (void)LIN_LPUART_DRV_GotoIdleState(instance);
                    }
                }
            }
            break;
        /* if current state is SENDING DATA */
        case LIN_NODE_STATE_SEND_DATA:
            if (LPUART_HAL_GetStatusFlag(base, LPUART_TX_DATA_REG_EMPTY) == false)
            {
                linCurrentState->currentEventId = LIN_READBACK_ERROR;
                if (linCurrentState->isTxBlocking == false)
                {
                    /* callback function to handle Readback error */
                    linCurrentState->Callback(instance, linCurrentState);
                    /* Clear Bus bus flag */
                    linCurrentState->isBusBusy = false;
                    linCurrentState->isTxBusy = false;
                    /* Change node's current state to IDLE */
                    (void)LIN_LPUART_DRV_GotoIdleState(instance);
                }
                break;
            }
            else
            {
                if (((*linCurrentState->txBuff != tmpByte) && ((linCurrentState->txSize - linCurrentState->cntByte) != 1U)) || \
                    (((linCurrentState->txSize - linCurrentState->cntByte) == 1U) && (linCurrentState->checkSum != tmpByte)))
                {
                    linCurrentState->currentEventId = LIN_READBACK_ERROR;
                    if (linCurrentState->isTxBlocking == false)
                    {
                        /* callback function to handle Readback error */
                        linCurrentState->Callback(instance, linCurrentState);
                        /* Clear Bus bus flag */
                        linCurrentState->isBusBusy = false;
                        linCurrentState->isTxBusy = false;
                        /* Change node's current state to IDLE */
                        (void)LIN_LPUART_DRV_GotoIdleState(instance);
                    }
                    break;
                }
                else
                {
                    linCurrentState->txBuff++;
                    linCurrentState->cntByte++;
                }
            }

            if (linCurrentState->cntByte < linCurrentState->txSize)
            {
                /* Send checksum byte */
                if ((linCurrentState->txSize - linCurrentState->cntByte) == 1U)
                {
                    LPUART_HAL_Putchar(base, linCurrentState->checkSum);
                }
                /* Send data bytes */
                else
                {
                    LPUART_HAL_Putchar(base, *linCurrentState->txBuff);
                }
            }
            else
            {
                linCurrentState->currentEventId = LIN_TX_COMPLETED;
                if (linCurrentState->isTxBlocking == false)
                {
                    LPUART_HAL_SetIntMode(base, LPUART_INT_RX_DATA_REG_FULL, false);
                    linCurrentState->currentNodeState = LIN_NODE_STATE_CALLBACK;
                    /* callback function to handle event TX COMPLETED */
                    linCurrentState->Callback(instance, linCurrentState);
                    /* Clear Bus bus flag */
                    linCurrentState->isBusBusy = false;
                    linCurrentState->isTxBusy = false;
                    /* Change node's current state to IDLE */
                    (void)LIN_LPUART_DRV_GotoIdleState(instance);
                    LPUART_HAL_SetIntMode(base, LPUART_INT_RX_DATA_REG_FULL, true);
                }
            }
            break;
        default:
            /* Other node state */
            break;
    }
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LIN_LPUART_DRV_WaitComplete
 * Description   : This function waits until transmission/reception is complete and
 * returns status of the transaction.
 *
 *END**************************************************************************/
static lin_status_t LIN_LPUART_DRV_WaitComplete(uint32_t instance)
{
    /* Get the current LIN state of this LPUART instance. */
    lin_state_t *linCurrentState = g_linStatePtr[instance];
    lin_event_id_t eventId;
    lin_status_t retVal = LIN_ERROR;
    while(true)
    {
        /* Get the current event ID */
        eventId = linCurrentState->currentEventId;
        /* If the current event ID is dif ferent than LIN_NO_EVENT */
        if (eventId != LIN_NO_EVENT)
        {
            /* Check if the current event ID is LIN_TX_COMPLETED or LIN_RX_COMPLETED */
            if ((eventId == LIN_TX_COMPLETED) || (eventId == LIN_RX_COMPLETED))
            {
                retVal = LIN_SUCCESS;
                break;
            }
            /* Check if the TimeoutCounterFlag is false */
            else
            {
                if (linCurrentState->timeoutCounterFlag == false)
                {
                    retVal = LIN_ERROR;
                    break;
                }
            }
        }
        /* Check if the TimeoutCounterFlag has been set */
        if (linCurrentState->timeoutCounterFlag == true)
        {
            retVal = LIN_TIMEOUT;
            break;
        }
    }

    return retVal;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LIN_LPUART_DRV_GotoIdleState
 * Description   : This function puts current node to Idle state.
 *
 *END**************************************************************************/
lin_status_t LIN_LPUART_DRV_GotoIdleState(uint32_t instance)
{
    /* Get base address of the LPUART instance. */
    LPUART_Type * base = g_linLpuartBase[instance];

    /* Get the current LIN state of this LPUART instance. */
    lin_state_t *linCurrentState = g_linStatePtr[instance];

