arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lin/fsl_lin_lpuart_driver.c
    linCurrentState->currentEventId = LIN_NO_EVENT;
    linCurrentState->cntByte = 0U;

    /* Set Break char detect length as 13 bits minimum */
    LPUART_HAL_SetBreakCharDetectLength(base, LPUART_BREAK_CHAR_13_BIT_MINIMUM);

    /* Set Receive data not inverted */
    LPUART_HAL_SetRxDataPolarity(base, false);

    /* Enable RX complete interrupt */
    LPUART_HAL_SetIntMode(base, LPUART_INT_RX_DATA_REG_FULL, true);

    /* Disable RXEDG interrupt */
    LPUART_HAL_SetIntMode(base, LPUART_INT_RX_ACTIVE_EDGE, false);

    /* Enable frame error interrupt */
    LPUART_HAL_SetIntMode(base, LPUART_INT_FRAME_ERR_FLAG, true);

    /* Enable lin break detect interrupt */
    LPUART_HAL_SetIntMode(base, LPUART_INT_LIN_BREAK_DETECT, true);

    /* Change node's current state to IDLE */
    linCurrentState->currentNodeState = LIN_NODE_STATE_IDLE;

    return LIN_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LIN_LPUART_DRV_AutobaudTimerValEval
 * Description   : This function calculate LIN bus baudrate and set slave's baudrate accordingly.
 * Autobaud process runs only once after reset. After setting slave's baudrate to LIN bus baudrate,
 * slave does not evaluate LIN bus baudrate anymore.
 * This is not a public API as it is called from other driver functions.
 *
 *END**************************************************************************/
static void LIN_LPUART_DRV_AutobaudTimerValEval(uint32_t instance,
                                                lin_user_config_t * linUserConfig)
{
    uint32_t bitTimeLength = 0U;
    uint32_t MasterBaudrate = 0U;

    /* Get base address of the LPUART instance. */
    LPUART_Type * base = g_linLpuartBase[instance];

     /* Get the current LIN state of this LPUART instance. */
    lin_state_t *linCurrentState = g_linStatePtr[instance];


    (void)linUserConfig->timerGetUsCallback(&bitTimeLength);

    /* Calculate the average bit time value */
    bitTimeLength = bitTimeLength >> 3U;

    /* Evaluate average value against baudrate */
    if ((bitTimeLength <= BIT_TIME_MAX_19200) && (bitTimeLength > BIT_TIME_MIN_19200))
    {
        MasterBaudrate = 19200U;
    }
    else
    {
        if ((bitTimeLength <= BIT_TIME_MAX_14400) && (bitTimeLength > BIT_TIME_MIN_14400))
        {
            MasterBaudrate = 14400U;
        }
        else
        {
            if ((bitTimeLength <= BIT_TIME_MAX_9600) && (bitTimeLength > BIT_TIME_MIN_9600))
            {
                MasterBaudrate = 9600U;
            }
            else
            {
                if ((bitTimeLength <= BIT_TIME_MAX_4800) && (bitTimeLength > BIT_TIME_MIN_4800))
                {
                    MasterBaudrate = 4800U;
                }
                else
                {
                    if ((bitTimeLength <= BIT_TIME_MAX_2400) && (bitTimeLength > BIT_TIME_MIN_2400))
                    {
                        MasterBaudrate = 2400U;
                    }
                }
            }
        }
    }

    /* Check Master Baudrate against node's current baudrate */
    if ((MasterBaudrate != 0U) && (linUserConfig->baudRate != MasterBaudrate))
    {
        linUserConfig->baudRate = MasterBaudrate;
        /* Set new baudrate */
        (void)LPUART_HAL_SetBaudRate(base, linCurrentState->linSourceClockFreq, linUserConfig->baudRate);
        linCurrentState->currentEventId = LIN_BAUDRATE_ADJUSTED;
        /* Disable baudrate evaluation process */
        linCurrentState->baudrateEvalEnable = false;
        /* Callback function to handle this event */
        linCurrentState->Callback(instance, linCurrentState);
    }
}

/*******************************************************************************
 * EOF
 ******************************************************************************/
